reproPack/code/cases/bouncing_sphere/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;// startTime;//

startTime       1.06;

stopAt          endTime;

endTime         10.0;

deltaT          0.00005;

writeControl    timeStep;//

writeInterval   2000;//10;//0.05;//

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;

maxAlphaCo      0.5;

maxDeltaT       1;


// ************************************************************************* //

functions
{
    volumeAverage
    {
        type            volRegion;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;
        log             true;
        writeControl    writeTime;
//        writeControl    writeInterval;
        writeFields     true;

        regionType      all;
        operation       volAverage;

        fields
        (
            alpha.water
	    voidfractionNext
        );
    }

}


// ************************************************************************* //
