reproPack/code/cases/bouncing_sphere/CFD/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    wall      
    {
        type            fixedValue;
        value           uniform (0 0 0);
//        type            zeroGradient;

    }

    outlet      
    {
        type           zeroGradient;
    }

    /*frontAndBack    
    {
        type            empty;
    }*/
}

// ************************************************************************* //
